In [4]:
import numpy as np
import pandas as pd

In [5]:
dict1 = {

    'Name' : ['Harry','Ashraf','Saif','Vinay','Deepak'],
    'Marks' : [12,34,45,67,45],
    'city' : ['England','Chandauli','Ghundi Kund Kala','Ghazipur','Ghazipur']
}

In [6]:
df = pd.DataFrame(dict1)

In [7]:
df

     Name  Marks              city
0   Harry     12           England
1  Ashraf     34         Chandauli
2    Saif     45  Ghundi Kund Kala
3   Vinay     67          Ghazipur
4  Deepak     45          Ghazipur

In [8]:
df.to_csv('friends.csv')

In [9]:
df.to_csv('friends_index_false.csv', index=False)

In [10]:
df

     Name  Marks              city
0   Harry     12           England
1  Ashraf     34         Chandauli
2    Saif     45  Ghundi Kund Kala
3   Vinay     67          Ghazipur
4  Deepak     45          Ghazipur

In [11]:
df.head(2)

     Name  Marks       city
0   Harry     12    England
1  Ashraf     34  Chandauli

In [12]:
df.tail(3)

     Name  Marks              city
2    Saif     45  Ghundi Kund Kala
3   Vinay     67          Ghazipur
4  Deepak     45          Ghazipur

In [13]:
df.describe()

           Marks
count   5.000000
mean   40.600000
std    19.982492
min    12.000000
25%    34.000000
50%    45.000000
75%    45.000000
max    67.000000

In [18]:
x = pd.read_csv('friends_copy.csv')

In [19]:
x

   S.no.    Name  Marks              city
0      0   Harry     12           England
1      1  Ashraf     34         Chandauli
2      2    Saif     45  Ghundi Kund Kala
3      3   Vinay     67          Ghazipur
4      4  Deepak     45          Ghazipur
5      5   Sahil     70  Ghundi Kund Kala

In [20]:
x['Name']

0     Harry
1    Ashraf
2      Saif
3     Vinay
4    Deepak
5     Sahil
Name: Name, dtype: object